GrieferPig/linux-esp32-s31/include/dt-bindings/clock/esp32s31-clock.h
/* SPDX-License-Identifier: GPL-2.0-only OR BSD-2-Clause */
#ifndef _DT_BINDINGS_CLOCK_ESP32S31_CLOCK_H
#define _DT_BINDINGS_CLOCK_ESP32S31_CLOCK_H

#define ESP32S31_CLK_XTAL		0
#define ESP32S31_CLK_SYS		1
#define ESP32S31_CLK_MPLL		2
#define ESP32S31_CLK_SDMMC_BIU		3
#define ESP32S31_CLK_SDMMC_CIU		4
#define ESP32S31_CLK_EMAC_STMMACETH	5
#define ESP32S31_CLK_EMAC_PCLK		6
#define ESP32S31_CLK_EMAC_PTP_REF	7
#define ESP32S31_CLK_EMAC_RGMII_TXC	8
#define ESP32S31_CLK_UART0		9
#define ESP32S31_CLK_UART1		10
#define ESP32S31_CLK_UART2		11
#define ESP32S31_CLK_WDT1		12
#define ESP32S31_CLK_WDT0		13
#define ESP32S31_CLK_SYSTIMER		14
#define ESP32S31_CLK_AHB_GDMA		15
#define ESP32S31_CLK_LEDC0		16
#define ESP32S31_CLK_LEDC1		17
#define ESP32S31_CLK_MCPWM0		18
#define ESP32S31_CLK_MCPWM1		19
#define ESP32S31_CLK_MCPWM2		20
#define ESP32S31_CLK_MCPWM3		21
#define ESP32S31_CLK_PCNT0		22
#define ESP32S31_CLK_PCNT1		23
#define ESP32S31_CLK_UHCI		24
#define ESP32S31_CLK_I2C0		25
#define ESP32S31_CLK_I2C1		26
#define ESP32S31_CLK_TWAI0		27
#define ESP32S31_CLK_TWAI1		28
#define ESP32S31_CLK_UART3		29
#define ESP32S31_CLK_GPSPI2		30
#define ESP32S31_CLK_GPSPI3		31
#define ESP32S31_CLK_I2S0		32
#define ESP32S31_CLK_I2S1		33

/* Read-only root/source clocks discovered from the bootloader hand-off. */
#define ESP32S31_CLK_RC_FAST		34
#define ESP32S31_CLK_RC_SLOW		35
#define ESP32S31_CLK_XTAL32K		36
#define ESP32S31_CLK_CPLL		37
#define ESP32S31_CLK_BBPLL		38
#define ESP32S31_CLK_APLL		39
#define ESP32S31_CLK_PLL_F20		40
#define ESP32S31_CLK_PLL_F25		41
#define ESP32S31_CLK_PLL_F50		42
#define ESP32S31_CLK_PLL_F80		43
#define ESP32S31_CLK_PLL_F160		44
#define ESP32S31_CLK_PLL_F240		45
#define ESP32S31_CLK_CPU		46
#define ESP32S31_CLK_MEM		47
#define ESP32S31_CLK_APB		48
#define ESP32S31_CLK_PLL_F120		49
#define ESP32S31_CLK_PLL_F60		50
#define ESP32S31_CLK_XTAL_D2		51
#define ESP32S31_CLK_RTC_FAST		52
#define ESP32S31_CLK_RTC_SLOW		53

#define ESP32S31_CLK_NR			54

#endif
